In [1]:
# Q1. Create a Pandas Series that contains the following data: 
#     4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import numpy as np

In [5]:
data=np.array([4,8,15,16,23,42])

In [6]:
ser = pd.Series(data)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [7]:
# Q2. Create a variable of list type containing 10 elements in it, 
# and apply pandas.Series function on the
# variable print it.

In [8]:
data2=np.array(["a","b","c","d","e","f","g","h","i","j"])

In [10]:
ser2=pd.Series(data2)
print(ser2)

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
dtype: object

In [11]:
# Q3. Create a Pandas DataFrame that contains the following data:

In [30]:
import pandas as pd

dict1 = {'Name': pd.Series(['Alice',
              'Bob', 'Claire'],
          index=['SNo1', 'SNo2', 'SNo3']),
         'Age': pd.Series([25,30,27],
                   index=['SNo1', 'SNo2', 'SNo3']),
         'Gender': pd.Series(['female','male','female'],
                index=['SNo1', 'SNo2', 'SNo3'])}
 
# Creating Dataframe
df = pd.DataFrame(dict1, index=['SNo1', 'SNo2', 'SNo3'])
# Printing dataframe
print(df)

        Name  Age  Gender
SNo1   Alice   25  female
SNo2     Bob   30    male
SNo3  Claire   27  female

In [31]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? 
# Explain with an example.

In [32]:
# Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous 
# tabular data structure with labeled axes (rows and columns). A Data frame is a 
# two-dimensional data structure, i.e., data is aligned in a tabular fashion in 
# rows and columns. Pandas
# DataFrame consists of three principal components, the data, rows, and columns.

In [35]:
lst=['mimi','cyan','tin']
df=pd.DataFrame(lst)
print(df)

      0
0  mimi
1  cyan
2   tin

In [36]:
# Q5. What are some common functions you can use to manipulate data in a Pandas 
# DataFrame? Can you give an example of when you might use one of these functions?

In [37]:
# Pandas is an open-source library that is used from data manipulation to 
# data analysis & is very powerful, flexible & easy to use tool which can be
# imported using import pandas as pd. Pandas deal essentially with data in 1-D 
# and 2-D arrays; Although, pandas handles these two differently. In pandas, 
# 1-D arrays are stated as a series & 
# a dataframe is simply a 2-D array.

In [39]:
import pandas as pd
 
# assign dataset
df = pd.read_csv("data.csv")
 
# display
print("Type-", type(df))
df

Type- <class 'pandas.core.frame.DataFrame'>

   name           email    phone no
0   amy   amy@gmail.com  9879076534
1  reen  reen@gmail.com  9878345678

In [45]:
# Summary of Statistics of DataFrame using describe() method.

In [46]:
df.describe()

           phone no
count  2.000000e+00
mean   9.878711e+09
std    5.167932e+05
min    9.878346e+09
25%    9.878528e+09
50%    9.878711e+09
75%    9.878894e+09
max    9.879077e+09

In [47]:
# Creating a dataframe manually:

In [48]:
student = pd.DataFrame({'Name': ['Rohan', 'Rahul', 'Gaurav',
                                 'Ananya', 'Vinay', 'Rohan',
                                 'Vivek', 'Vinay'],
                         
                        'Score': [76, 69, 70, 88, 79, 64, 62, 57]})
 
# Reading Dataframe
student

     Name  Score
0   Rohan     76
1   Rahul     69
2  Gaurav     70
3  Ananya     88
4   Vinay     79
5   Rohan     64
6   Vivek     62
7   Vinay     57

In [49]:
# Sorting the DataFrame using sort_values() method.

In [50]:
student.sort_values(by=['Score'], ascending=True)

     Name  Score
7   Vinay     57
6   Vivek     62
5   Rohan     64
1   Rahul     69
2  Gaurav     70
0   Rohan     76
4   Vinay     79
3  Ananya     88

In [52]:
# Creating another column in DataFrame, Here we will create column name percentage which will calculate the percentage of student score by using aggregate function sum().

In [53]:
student['Percentage'] = (student['Score'] / student['Score'].sum()) * 100
student

     Name  Score  Percentage
0   Rohan     76   13.451327
1   Rahul     69   12.212389
2  Gaurav     70   12.389381
3  Ananya     88   15.575221
4   Vinay     79   13.982301
5   Rohan     64   11.327434
6   Vivek     62   10.973451
7   Vinay     57   10.088496

In [54]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [55]:
#ans: dataframe is mutable in nature

In [56]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [ ]:
student = pd.DataFrame({'Name': ['Rohan', 'Rahul', 'Gaurav',
                                 'Ananya', 'Vinay', 'Rohan',
                                 'Vivek', 'Vinay'],
                         
                        'Score': [76, 69, 70, 88, 79, 64, 62, 57],
                       'Age':[20]
                       })
 
# Reading Dataframe
student